// 1. জাভাস্ক্রিপ্ট কি জিনিস এইটা কি জানো?
    জাভাস্ক্রিপ্ট একটি স্ক্রিপ্টি ং বা প্রোগ্রামি ং ভাষা যা আপনাকে ওয়েব পৃষ্ঠাগুলি তে জটিল বৈশিষ্ট্যগুলি প্রয় োগ করতে দেয়।
    উদাহরণ ঃ
    সময়মত কন্টেন্ট আপডেট, ইন্টারেক্টিভ ম্যাপ, অ্যানিমেটেড 2D/3D গ্রাফিক্স, স্ক্রলি ং ভিডিও ইত্যাদি প্রদর্শন করা।
    জাভাস্ক্রিপ্ট 1995 সালে ব্রেন্ডন আইক দ্বারা উদ্ভাবিত হয়েছিল। এটি নেটস্কেপ 2-এর জন্য তৈরি করা হয়েছিল এবং 1997
    সালে ECMA-262 স্ট্যান্ডার্ডে পরিণত হয়েছিল।

 
// 2.জাভাস্ক্রিপ্ট কিভাবে কাজ করে সেটা কি জানো?
    জাভাস্ক্রিপ্ট একটি interpreted language. এটি compiled languag নয় যেমনটা c,c++,java। Environment or
    browser এ একটি ইঞ্জিন থাকা দরকার, যা মানবপাঠ যোগ্য সিনট্যাক্সে লেখা JS কোড নেয় এবং এটিকে মেশিনকোডে পরিণত করে । Chrome এর ক্ষেত্রে এই ইঞ্জিনটির নাম V8, firefox এ SpiderMonkey ইত্যাদি ।

 
// 3.ভেরিয়েবল কি জিনিস?
        ভেরিয়েবল মানে যা পরিবর্তিত হতে পারে । জাভাস্ক্রিপ্টে , একটি ভেরিয়েবল ডেটা মান সংরক্ষণ করে যা পরে পরিবর্তন করা যেতে পারে । জাভাস্ক্রিপ্টে একটি ভেরিয়েবল ঘোষণা করতে সংরক্ষিত কীওয়ার্ড var ব্যবহার করতে হয়।
    
        *উদাহরণঃ- var favouriteFootballer = "Casemiro";
    
// 4.ভেরিয়েবল কিভাবে ডিক্লেয়ার করে ??
        পাঁচটি কাজ করে একটি ভে রি য়ে বল ডি ক্লে য়ার করা যায়।
        ● প্রথমে var keyword,
        ● Meaningful ভে রি য়ে বল নাম,
        ● ( = ) sign দি তে হবে ,
        ● মান সংরক্ষণ,
        ● ( ; ) sign দি তে হবে (optional)।

        উদাহরণঃ- var favoriteClub = "Real Madrid C.F.";


// 5.ভেরিয়েবল এর মান কিভাবে চেইঞ্জ করে বা আপডেট করে। 
    ২ ভাবে মান পরিবর্তন করা যায়,২টা variation আছে ভেরিয়েবল পরিবর্তন করার।
        no1-
        প্রথমে ভেরিয়েবল ডিক্লেয়ার করতে হবে . তারপর চেইঞ্জ করতে বাকি সব ঠিক রেখে শুধুমানটা পরিবর্তন করতে হয়।
        যেমনঃ
        ডিক্লেয়ারঃ
        var holiday = "Friday";
        চেইঞ্জঃ
        var holiday = "Sunday";
        এমনটা শুধু var keyword এর ক্ষেত্রে হবে । এটি Recommended না।

        প্রথমে ভেরিয়েবল ডিক্লেয়ার করতে হবে . তারপর চেইঞ্জ করতে ভার keyword বাদ দিয়ে বাকি সব ঠিক রেখে শুধু
        মানটা পরিবর্তন করতে হয়।
        যেমনঃ
        ডিক্লেয়ারঃ
        var holiday = "Friday";
        চেইঞ্জঃ
        holiday = "Sunday";
        এটি Recommended।

// 6.কি কি ধরণের ভেরিয়েবল হয়। সেগুলা কি কি (হিন্টস: Numeric, String, Boolean)
    জাভাস্ক্রিপ্ট আপনাকে তিনটি প্রিমিটিভ ডেটা প্রকারের সাথে কাজ করতে দেয়: সংখ্যা, স্ট্রি ং, এবং বুলিয়ান। জাভাস্ক্রিপ্ট আরও দটিু ডেটা প্রকারকে ও সংজ্ঞায়িত করে , নাল এবং আনডিফাইন্ড।

        ● সংখ্যা যেমন ১,৩২,৫৪।
        ● স্ট্রি ং যেমন "রহিম","কারিম" ইত্যাদি ।
        ● বলিুলিয়ান যেমন true, false ।
        ● নাল বলতে কনো মান নেই। (একটু confusing)
        ● আন্ডি ফাইন্ড বলতে বুঝায় মান আছে কিন্তু তা জানা নাই। (একটুconfusing)


// 7.জাভাস্ক্রিপ এ primitive and non primitive data types কি কি ? উদাহরণ হিসেবে বলো। 
    সুতরাং primitive এবং non-primitive মধ্যে মৌলিক পার্থক্য হল ঃ
        ১- primitive মানগুলি অপরিবর্তনীয় এবং non-primitive মানগুলি পরিবর্তনযোগ্য।
        ২- primitive মান দ্বারা সংরক্ষণ করা হয় non-primitive রেফারেন্স দ্বারা সংরক্ষণ করা হয়।
        ৩-জাভাস্ক্রিপ্টের primitive ডেটা প্রকারের মধ্যে রয়েছে সংখ্যা, স্ট্রি ং, বলিুলিয়ান, অনির্ধারিত, নাল । নন-প্রিমিটিভ ডেটা টাইপের মধ্যে রয়েছে অ্যারে ,অবজেক্ট।
// 8.ভেরিয়েবল এর নাম কিভাবে কিভাবে ডিক্লেয়ার করতে হয়। কোন কোন জিনিস নাম এ লেখা যাবে না। অর্থাৎ Variable এর naming convention সম্পর্কে বলো। 
    ভেরিয়েবল এর নাম কিভাবে কিভাবে  ডিক্লেয়ার করতে হয়। এর উত্তর ৪ নং প্রশ্নে দেয়া হয়েছে । 
        কোন জিনিস লেখা যাবে নাহ??
        ● শুরুতে নাম্বার ($ ও _ বাদে ) অন্য কোন character ব্যাবহার করা যাবে না।
        ● স্ট্রি ং ব্যাবহার করা যাবে না।
        ● কোন Reserved keyword ব্যাবহার করা যাবে না।
        ● ক্যামেলকেস ব্যাবহার করা ভাল।
        ● Meaningful নাম দেয়া ভাল।


// 9.দুইটা ভেরিয়েবল এর মধ্যে =, -, *, /, % কিভাবে করে? 
    (=) এইটা আসাইনমেন্ট অপারেটর(একটির মান অন্য একটিতে বসানো), (-) বিয়োগ অপারেটর, (*) গুন অপারেটর, (/)ভাগ অপারেটর, (%) মডুলাস অপারেটর।
    উদাহরণঃ
    var firstNumber = 12;
    var secondNumber = 4;
    আসাইনমেন্ট অপারেটর
    firstNumber = secondNumber;
    console.log(firstNumber); // output : 4
    বিয়োগ অপারেটরঃ
    console.log(firstNumber - secondNumber); // output : 8
    গুন অপারেটরঃ
    console.log(firstNumber * secondNumber); // output : 48
    ভাগ অপারেটরঃ
    console.log(firstNumber / secondNumber); // output : 3
    মডুলাস অপারেটরঃ
    console.log(firstNumber % secondNumber); // output : ০

// 10.শর্টহ্যান্ড গুলো জানতে হবে। বিশেষ করে +=, -=, *=, /= জানতে হবে। 

    ● (+=) সংযোজন অ্যাসাইনমেন্ট অপারেটর একটি ভেরিয়েবলের সাথে সঠিক অপারেন্ডের মান যোগ করে এবং ভেরিয়েবলে ফলাফল বরাদ্দ করে ।

    ● (-=) বিয়োগ অ্যাসাইনমেন্ট অপারেটর একটি ভেরিয়েবল কে ডান অপারেন্ডের মান বিয়োগ করে এবং ভেরিয়েবলে ফলাফল বরাদ্দ করে ।

    ● (*=) গুন অ্যাসাইনমেন্ট অপারেটর একটি ভেরিয়েবল কে ডান অপারেন্ডের মান গুন করে এবং ভেরিয়েবলে ফলাফল বরাদ্দ করে ।

    ● (/=) ভাগ অ্যাসাইনমেন্ট অপারেটর একটি ভেরিয়েবল কে ডান অপারেন্ডের মান ভাগ করে এবং ভেরিয়েবলে ফলাফল বরাদ্দ করে ।

// 11.++ এবং -- এর কাজ কি ? এইটা কি জানো??
    '++' হল ইনক্রিমেন্ট অপারেটর। এটি 1 পরিবর্তনশীল বদ্ধিৃ. x++; x = x + 1 এর সমতুল্য; অথবা x += 1 এর সমতুল্য;
    '--' হল ডিক্রিমেন্ট অপারেটর। এটি 1 পরিবর্তনশীল হ্রাস. x--; x = x - 1 এর সমতুল্য; অথবা x -= 1 এর সমতুল্য;


// 12.parseInt, parseFloat, toFixed এইগুলা কি করে? 
    parseInt ফাংশনটি একটি স্ট্রি ং হিসাবে একটি মান গ্রহন করে এবং পূর্ণস ংখ্যা প্রদান করে ।
    parseFloat() ফাংশনটি একটি স্ট্রি ং গ্রহণ করতে এবং এটিকে একটি ফ্লোটিং-পয়েন্ট নম্বরে রূপান্তর করতে ব্যবহৃত হয়।
    toFixed() ফাংশনটি একটি সংখ্যাকে একটি স্ট্রি ংয়ে রূপান্তর করে এবং এটি স্ট্রি ংটিকে নির্দিষ্ট সংখ্যক দশমিকে রাউন্ড করে ।

// 13.Array কি জিনিস। এইটা কিভাবে কাজ করে? কিভাবে Array ডিক্লেয়ার করতে হয় ??

    Ans:ভ্যারিএবেলের মত ডিক্লেয়ার করে ,তবে মান রাখতে হয় থার্ড ব্রাকেটের মাঝে,মান গুলোর মাঝে কমা এবং গ্যাপ দিতে হয়।

    Array একটি non-primitive ডাটাটাইপ। জাভাস্ক্রিপ্ট অ্যারেগুলি ০ ইনডেক্সড: একটি অ্যারের প্রথম উপাদানটি্র ইনডেক্স 0, দ্বিতীয়টি ইনডেক্স 1 এ, তৃতীয় ইনডেক্স ২ এভাবে চলবে ।

    Array ডিক্লেয়ারঃ
        ● ভার keyword লেখতে হবে ।
        ● অ্যারে এর নাম দিতে হবে ।
        ● ( = ) sign দিতে হবে ।
        ● তারপর [ ] sign দিতে হবে এবং data গুলকে পাশাপাশি কমা দিয়ে separate রাখতে হবে ।।
        ● ( ; ) sign দিতে হবে (optional)।
// 14.array এর মধ্যে কয়টা উপাদান (element) আছে সেটা কিভাবে বের করে?? 

    array.length এই method টি ব্যাবহার করতে হবে ।


    উদাহরনঃ
    The way to find out number of element.
    var elementNUmber= [23,34,34,345,453,33,12]
    console.log(elementNUmber.length); // output-৭
    
    var friends = [' রহিম', 'কারিম', 'জদু', 'কদু'];
    console.log(friends.length) // output-4

15.
// 1.array এর উপাদান গুলা এর পজিশন ( index) কিভাবে কাজ করে?? 2.কত দিয়ে শুরু হয়??3.মান কিভাবে চেইঞ্জ হয়??
    জাভাস্ক্রিপ্ট অ্যারেগুলি ০ ইনডেক্সড: একটি অ্যারের প্রথম উপাদানটি্র ইনডেক্স 0, দ্বিতীয়টি ইনডেক্স 1 এ, তৃতীয় ইনডেক্স ২ এভাবে চলবে ।
1.How index position work??
    var numb = [23,34,45,34,44,34];
    console.log('index position');
    console.log(numb[2]);
    console.log(numb[3]);
    console.log(numb[4]);
    আউটপুটঃ
    index position        
    45
    34
    44

2.Index position Start from where??
    index start from 0.index 0 means frist positional number.

3.How to changes value??
    var numbers = [23,34,45,56,67,78,12,12];
    numbers[3] = 65;
    numbers[4] = 1005;
    console.log('Changing value');
    console.log(numbers);
    আউটপুটঃ 
    Changing value        
    [
        23,   34, 45,
        65, 1005, 78,
        12,   12
    ]

// 16.কোন একটা উপাদানের index এর মান -১ বলতে কি বুঝায় ?জ
কোন একটা উপাদানের index এর মান -১ বলতে কি বুঝায় ওই উপাদানটি array তে নাই।

// 17.কিভাবে index দিয়ে কোন একটা array এর মধ্যে উপাদান এর মান খুঁজে বের করতে পারো??

অ্যারে এর উপাদানগুলো access করতে অ্যারে এর ইন্ডেক্স ব্যবহার করা হয়।

    arrayName[index of which value you wanna get]
    উদাহরণঃ-
    var friends = [' রহিম', 'কারিম', 'জদু', 'কদু'];
    এই অ্যারে টার ২ নং ইন্ডে ক্স এর ভ্যালুহবে
    var valueOfIndexOne = friends[1];
    console.log(valueOfIndexOne);
    output:- ' কারিম'

    var numbers = [23,34,45,56,67,78,12,12];
    var elem = numbers[3];
    console.log('finding value');
    console.log(elem);


// 18.কিভাবে কোন একটা index পজিশন এ array এর উপাদান এর মান চেইঞ্জ করতে পারবে??

    এভাবে ঃ-
    var friends = [' করিম', 'রহিম', 'জদু', 'কদু'];
    friends[1] = (' আধু');
    console.log(friends);
    output:-
    [' রহিম', 'উদু', 'জদু', 'কদ']
    3.How to changes index position in array??*/
    var numbers = [23,34,45,56,67,78,12,12];
    numbers[3] = 65;
    numbers[4] = 1005;
    console.log('Changing value');
    console.log(numbers);

// 19.একটা Array এর মধ্যে কোন একটা উপাদান এর মান তোমাকে দেয়া আছে এখন সেটার index তুমি কিভাবে খুঁজে বের করতে পারো?

    ভ্যালু থেকে ও ইন্ডেক্সকে acces করতে পারি । 
    এর উপায় হলো arrayName.indexOf( value );
    উদাহরণঃ-
    var friends = [' রহি ম', 'কারি ম', 'জদ', 'কদু'];
    // এই অ্যারেটার ''জদ'ুএর অন্ডে ক্স ভ্যালুহবে
    var indexOfJodu = friends.indexOf( 'জদ')
    console.log(indexOfJodu);
    output:- ২

    var numbers = [23,34,45,56,67,78,12,12];
    var positionIndex = numbers.indexOf(67);
    console.log( 'find index number');
    console.log(positionIndex);


// 20.ধরো, কোন একটা ইনডেক্স দিয়ে উপাদান খুঁজতে গেছো। কিন্তু সেটার মান না দিয়ে তোমাকে undefined দেখাচ্ছে। সেটা দেখে তুমি কি বুঝবে? (একটু গুগলে সার্চ দাও। আমরা কোর্স এ এইটা আলোচনা করিনি। তারপরেও চেষ্টা করে দেখো)
    আবার আমরা ভ্যাল থেকে ও ইন্ডেক্সকে acces করতে পারি । এর উপায় হলো arrayName.indexOf( value );
    উদাহরণঃ-
    var friends = [' রহি ম', 'কারি ম', 'জদ', 'কদ'];
    এই অ্যারে টার ''জদ'ুএর অন্ডে ক্স ভ্যালুহবে
    var indexOfJodu = friends.indexOf( 'জদ')
    console.log(indexOfJodu);
    output:- ২

// 21. কোন একটা Array এর মধ্যে লাস্ট উপাদান হিসেবে কোন উপাদান হিসেবে যোগ করতে চাইলে কিভাৱে যোগ করবে। আবার Array থেকে শেষের উপাদান টা বের করে দিতে চাইলে কিভাবে বের করে দিবে.
 How to add element to an array as the last element of array??
    using the push
    var friends  = ['balam','kaalm','salam','jalam']
    friends.push('pailam')
    console.log('pushing item');
    friends.pop();
    console.log(friends);


   var amrai = ['ratul','rayhan','fahad','abdullah','shawon','rasel','khokon'] 
   amrai.push('Rohingha');
   console.log('Rohingha added in amrai');
   console.log(amrai);
 How to kick element to an array as the last element of array??
    using the pop
        var friends  = ['balam','kaalm','salam','jalam']
        friends.pop();
        console.log('poping item');
        console.log(friends);


        var amrai = ['ratul','rayhan','fahad','abdullah','shawon','rasel','rohingha'] 
        amrai.pop();
        console.log('Kick outing Rohingha ');
        console.log(amrai);
// 22.
// কোন একটা Array এর মধ্যে প্রথম উপাদান হিসেবে কোন উপাদান হিসেবে যোগ করতে চাইলে কিভাৱে যোগ করবে। আবার Array থেকে প্রথম উপাদান টা বের করে দিতে চাইলে কিভাবে বের করে দিবে

    array.shift() ইউস করে করা যায়।
    এই (array.shift) function যে টি শুরু থে কে delete হয়ে ছে সে টি return করে ।
    var friends = [' রহি ম', 'কারি ম', 'জদ', 'কদ'];
    var deleteItem = friends.shift();
    console.log(deleteItem)//' রহিম'


23.
// তুলনা কিভাবে করতে হয়। এইগুলার মানে কি: >, <, ==, !=, <=, >=, ===, !==, &&, ।। 
    ১- (>) (বড়> ছোট) greater than দইু বা ততোধিক সংখ্যা, পরিমাণ বা মান তুলনা করতে ব্যবহৃত হয়।

    2- (<) (ছোট < বড় ) less than দইু বা ততোধিক সংখ্যা, পরিমাণ বা মান তুলনা করতে ব্যবহৃত হয়।

    3- (==) double equal হল 'ইকুয়াল টু' চিহ্ন। একে 'তুলনা অপারেটর' বলা হয়। যেমন 5 + 10 == 15।

    4- (===) triple equal ও 'তুলনা অপারে টর' কিন্তু এর মানে , ধরন এবং মান উভয়ই সমান হতে হবে ।
    // যেমনঃ console.log("1"==="1")// true,console.log("1"=== 1)// false

    5- (!=) not equal পরীক্ষা করে যে এর দটিু অপারেন্ড সমান নয়, একটি বলিুলিয়ান ফলাফল প্রদান করে

    6- (<=) less than equal বাম অপারেন্ড যদি ডান অপারেন্ডের চেয়ে কম বা সমান হয় তবে তার চেয়ে কম বা সমান অপারেটর ( <= ) সত্য প্রদান করে এবং অন্যথায় মিথ্যা।

    7- (>=) grater that equal বাম অপারেন্ড ডান অপারেন্ডের চেয়ে বড় বা সমান হলে বহৃত্তর বা সমান অপারেটর ( >=) সত্য দেখায় এবং অন্যথায় মিথ্যা।

    8- (!==) not equal with type ৫ নং টাইপ এর মত কিন্তু এর ধরন এবং মান উভয়ই ভিন্ন হতে হবে ।

    9- (&&) double and দটিু condition এর দটিুই সত্য হতে হবে ।

    10- (||) double or দটিু condition এর যে কোন একটি সত্য হতে হবে ।
24.
// তোমার কাছে: ৮০০০০ টাকার বেশি হলে তুমি mac কিনবে, ৬০ টাকার বেশি হলে gaming ল্যাপটপ কিনবে, ৪০ হাজার টাকার বেশি হলে lenovo yoga কম্পিউটার কিনবে , ২০ হাজার টাকার বেশি হলে পুরান ল্যাপটপ কিনবে। না হয় তুমি মোবাইল দিয়ে কাজ চালাবে।
    var money = 45000;
    if (money >= 80000) {
        console.log('Ami Patti oyala mac kinbo');
    }else if (money >= 60000) {
        console.log('Gaming laptop is best');
    }
    else if (money >= 50000) {
        console.log('Motamoti Maner HP neyar try korbo');
    }
    else if (money >= 40000) {
        console.log('AAre lenevo yoga ache nah!! Niye nibo..');
    }
    else if (money >= 20000) {
        console.log('Second Hand khub Kharap nah,Niya nibo');
    }
    else {
        console.log('Amar moto Goriber Mobile Best.');
    }
25.
// আসকে আমার মন ভালো নেই -- এই কথা ৩৯ বার আউটপুট হিসেবে দেখাও। 
    for (let i = 0; i <=39; i++) {
        const i = 'আসকে আমার মন ভালো নেই।';
        console.log(i);
    } 
26.
// while লুপ কিভাবে কাজ করে ??
    একটি while লপু হল একটি লপু যেটি চলতে থাকে এবং একটি while স্টেটমেন্ট কার্যকর করে যতক্ষণ পর্যন্ত একটি পূর্বনির্ধারত শর্ত সত্য থাকে । প্রতিটি পুনরাবৃত্তির পরে,লপু পরীক্ষা করে যে শর্তটি সত্য রয়েছে । যদি শর্তটি এখন মিথ্যা হয়, লপুটি বন্ধ হয়ে যায়।

27.
// for লুপ কিভাবে কাজ করে ??
    ১- init ধাপটি প্রথমে এবং শুধুমাত্র একবার সম্পাদিত হয়। এই ধাপটি আপনাকে যে কোনো লপু কন্ট্রোল ভেরিয়েবল ঘোষণা এবং আরম্ভ করতে দেয়।
    ২- এর পরে , অবস্থা মূল্যায়ন (condition check) করা হয় ।'ফর' লুপের বডি কার্যকর হওয়ার পরে , নিয়ন্ত্রণের প্রবাহ বদ্ধিৃ (incriment) বিবতিৃতিতে ফিরে যায়। অবস্থা এখন আবার মূল্যায়ন করা হয়।
    ৩- অবস্থা মুল্যায়ন false ভ্যালুদি লে লপুটি বন্ধ হয়ে যায়।
28.
// while লুপ এর মধ্যে লুপ ভেরিয়েবল চেইঞ্জ না করলে কি সমস্যা হয়।
    ইনফিনিটি ওয়ার শুরু করে দিবে,মানে nfinity times পর্যন্ত লপু চলতে থাকবে ।
 
29.
//  একটা কোড লিখে ৫৮ থেকে ৯৮ পর্যন্ত যত সংখ্যা আছে সেগুলাকে দেখাও
    for (let i = 58; i <= 98; i++) {
        const element = i;
        console.log(element);  
    }
30.
// একটা কোড লিখে ৪১২ থেকে ৪৫৬ পর্যন্ত যত জোর সংখ্যা আছে সেগুলাকে দেখাও
    for (var i = 412; i <= 456; i += 2 ) {
        console.log(i);
    }
31.
// একটা কোড লিখে ৫৮১ থেকে ৬২৩ পর্যন্ত যত বিজোড় সংখ্যা আছে সেগুলাকে দেখাও
    for (let i = 581; i < 623; i += 2) {
        console.log(i);
    }
32.
// while আর for loop এর মধ্যে পার্থক্য কি
    for loop :
        ● ইনিশিয়ালাইজেশন, কন্ডিশন চেকি ং, এবং রিটেশন স্টেটমেন্ট লুপের শুরুতে লেখা হয়।
        ● এটি শুধুমাত্র তখনই ব্যবহৃত হয় যখন পুনরাবৃত্তির সংখ্যা আগে থেকে জানা যায়।
        ● শর্তটি 'ফর' লপেুপে উল্লেখ না থাকলে , লপুটি অসীম সংখ্যক বার পুনরাবত্তিৃত্তি করে ।
        ● ইনিশিয়ালাইজেশন শুধুমাত্র একবার করা হয়, এবং এটি পুনরাবৃত্তি হয় নাই।
    while loop:
        ● লুপের শুরুতে ইনিশিয়ালাইজেশন এবং কন্ডিশন চেকি ং করা হয়।
        ● এটি শুধুমাত্র তখনই ব্যবহৃত হয় যখন পুনরাবৃত্তির সংখ্যা জানা যায় না।
        ● যদি শর্তটি 'while' লুপে উল্লেখ করা না থাকে , তাহলে এটি একটি compilation error এর কারণ হয়।
        ● কন্ডিশন চেক করার সময় যদি ইনিশিয়ালাইজেশন করা হয়, তাহলে প্রতি বার লপুটি পুনরাবত্তিৃত্তি করার সময় ইনিশিয়ালাইজেশন ঘটে ।
        ● iteration statement লপেুপের ভিতরের যে কোন বিন্দুতে লেখা যেতে পারে ।
33.
// তুমি এতদিন যা যা জিনিস শিখছো সেগুলার নাম দিয়ে একটা array বানাও। তারপর একটা for লুপ দিয়ে সেই array এর সব উপাদান কে আউটপুট হিসেবে দেখাও।
    let learningItems= ['HTML','CSS','TAILWIND','RESPONSIVE DESGINE','BOOTSTRAP','BASIC JAVASCRIPT'];
    for (var i = 0; i < learningItems.length; i++) {
        console.log(learningItems[i]);
    }
34.
//  তুমি এতদিন পর্যন্ত যে যে মডেলের মোবাইল ফোন ইউজ করেছো সেগুলার নাম দিয়ে একটা array বানাও। তারপর একটা while লুপ দিয়ে সেই array এর উপাদান গুলা একটা একটা করে আউটপুট হিসেবে দেখাও 
    var myUsedMobiles = ['Syamphony','Samsung','Sony','Vivo']
    var count = 0;
    while (myUsedMobiles.length > count) {
        console.log(myUsedMobiles[count]);
        count++;
    }
35.
// একটা ফর লুপ চালাও। ৩০ থেকে ৮৬ পর্যন্ত। আর এই লুপ ৪৪ এ গেলে ব্রেক করবে। সেই জিনিস কোড করে দেখাও 
    for (let i = 30; i < 86; i++) {
        const element = i;
        console.log(element);
        if (element >=44) {
            break;
        }
    }
36.
// তোমার যত বই আছে সেগুলার দাম নিয়ে একটা array লিখে ফেলো। যে বই গুলোর দাম ২০০ টাকার উপরে সেগুলাকে স্কিপ করবে। অর্থাৎ সেগুলাকে আউটপুট হিসেবে দেখাবে না। বাকিদের কে আউটপুট হিসেবে দেখাবে। দেখো করতে পারো কিনা।

    var bookPrices = [100,20,343,323,40,239,30,48,23,44.23,200,200.2];

    for (let i = 0; i < bookPrices.length; i++) {
        if (bookPrices[i] > 200) {
            continue;
        }
        console.log(bookPrices[i]);
    }









